import pandas as pd

data_food = {
    "Продукт": ["Хліб", "М'ясо", "Риба", "Сир", "Яйця", "Молоко", "Бургер", "Піцца", "Салат", "Шоколад"],
    "Категорія": ["Зернові", "М'ясо", "М'ясо", "Молочні", "Молочні", "Молочні", "Фастфуд", "Фастфуд", "Овочі", "Солодке"],
    "Калорії": [250, 400, 350, 300, 200, 100, 700, 800, 150, 500],
    "Білки": [8, 25, 22, 18, 13, 6, 20, 25, 3, 5]
}

df_food = pd.DataFrame(data_food)

print(df_food)

print("\nКалорії > 300:")
print(df_food[df_food["Калорії"] > 300])

print("\nСередні білки по категоріях:")
print(df_food.groupby("Категорія")["Білки"].mean())

print("\nСортування за калоріями ↓:")
print(df_food.sort_values(by="Калорії", ascending=False))